{
  "displayName": "CA001-RequireMFA-Admins",
  "description": "NIST 800-171 IA-2: Require MFA for all administrative accounts. Maps to CMMC AC.L2-3.1.1, IA.L2-3.5.3.",
  "state": "enabled",
  "conditions": {
    "users": {
      "includeRoles": [
        "62e90394-69f5-4237-9190-012177145e10",
        "194ae4cb-b126-40b2-bd5b-6091b380977d",
        "f28a1f50-f6e7-4571-818b-6a12f2af6b6c",
        "29232cdf-9323-42fd-ade2-1d097af3e4de",
        "b1be1c3e-b65d-4f19-8427-f6fa0d97feb9"
      ],
      "excludeUsers": [],
      "excludeGroups": []
    },
    "applications": {
      "includeApplications": ["All"],
      "excludeApplications": []
    },
    "clientAppTypes": [
      "browser",
      "mobileAppsAndDesktopClients"
    ]
  },
  "grantControls": {
    "operator": "OR",
    "builtInControls": ["mfa"],
    "customAuthenticationFactors": [],
    "termsOfUse": []
  },
  "sessionControls": {
    "signInFrequency": {
      "value": 4,
      "type": "hours",
      "isEnabled": true
    }
  },
  "metadata": {
    "nistControls": ["IA-2", "IA-2(1)", "IA-2(2)"],
    "cmmcPractices": ["AC.L2-3.1.1", "IA.L2-3.5.3"],
    "priority": "Critical",
    "lastUpdated": "2025-12-04"
  }
}
